docs/openopenings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-29 Mon 01:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OpenOpenings</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="@pawnzac" />
<meta name="description" content="OpenOpenings is a simple program for drilling chess openings and other lessons that have PGN files."
 />
<link rel="stylesheet" type="text/css" href="org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="preamble" class="status">
OpenOpenings<br>@pawnzac<br>2021-11-29 Mon 01:50
</div>
<div id="content">
<h1 class="title">OpenOpenings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge173bba">1. Introduction</a></li>
<li><a href="#org42b455f">2. Basic Game Rules</a></li>
<li><a href="#orge246bd2">3. Library Button</a></li>
<li><a href="#org64fd3f1">4. Start Button</a>
<ul>
<li><a href="#orgc4b4b18">4.1. Read Mode Unchecked</a></li>
<li><a href="#org04b6a8e">4.2. Read Mode Checked</a></li>
</ul>
</li>
<li><a href="#org5d28928">5. Hint Button</a></li>
<li><a href="#org529b0f4">6. Scores Button</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge173bba" class="outline-2">
<h2 id="orge173bba"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
OpenOpenings is an application for drilling chess openings and other chess lessons for which you have PGN files.  The application allows you to manage your lessons, read your lessons, and practice the lesson's moves.  
</p>
</div>
</div>

<div id="outline-container-org42b455f" class="outline-2">
<h2 id="org42b455f"><span class="section-number-2">2</span> Basic Game Rules</h2>
<div class="outline-text-2" id="text-2">
<p>
You select a chess game to play one color of, i.e. you might study a line in the French Defense, playing black.  The goal is to get the highest Move to Tries Ratio.  A try is any guess you make and a move is a move you have to figure out.  You can ask for hints as well in three levels (piece type, original square of the piece to move, and the move itself).  Each hint level costs 5 tries.
</p>
</div>
</div>

<div id="outline-container-orge246bd2" class="outline-2">
<h2 id="orge246bd2"><span class="section-number-2">3</span> Library Button</h2>
<div class="outline-text-2" id="text-3">
<p>
The Library Button opens a window listing the "books" you have already created in the library (it will be blank initially).  From here, you can perform various management actions on the books such as renaming them or deleting them.  You can also click <b>Add to Library</b> which will allow you to import PGN files into books or create new books to hold PGN files.
</p>

<p>
Multiple files can be selected to add to the library, they will all be added to the same book.  The initial names of the chapters are the "Event" tag in the PGN.
</p>

<p>
The Library windows are also used to <b>Select</b> the "chapter" of the book you want to practice or read.  Click <b>Select</b> to select the book highlighted in the list, and then <b>Select</b> the chapter in the same way on the subsequent window.
</p>
</div>
</div>

<div id="outline-container-org64fd3f1" class="outline-2">
<h2 id="org64fd3f1"><span class="section-number-2">4</span> Start Button</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc4b4b18" class="outline-3">
<h3 id="orgc4b4b18"><span class="section-number-3">4.1</span> Read Mode Unchecked</h3>
<div class="outline-text-3" id="text-4-1">
<p>
When the Read Mode checkbox is unchecked, clicking on the start button starts a scored training session where you try to correctly input the moves in the PGN file (for the color you selected represents the player when you added the game to the library).  None of the comments in the PGN file are displayed below the window and your score for the session is saved in the library.
</p>
</div>
</div>

<div id="outline-container-org04b6a8e" class="outline-3">
<h3 id="org04b6a8e"><span class="section-number-3">4.2</span> Read Mode Checked</h3>
<div class="outline-text-3" id="text-4-2">
<p>
When the Read Mode checkbox is checked, clicking on the start button starts an <i>unscored</i> training session useful for reading the lesson.  Comments in the PGN file are displayed below the board.
</p>
</div>
</div>
</div>

<div id="outline-container-org5d28928" class="outline-2">
<h2 id="org5d28928"><span class="section-number-2">5</span> Hint Button</h2>
<div class="outline-text-2" id="text-5">
<p>
The hint button gives you a hint.  There are three hint-levels.  Each hint level costs 5 tries.  The first tells you what type of piece to move.  The second tells you which piece to move.  The third tells you the exact move to make.  Right-clicking on the Hint Button goes immediately to the third hint level (revealing the move to make).  It costs the same number of tries either way.
</p>
</div>
</div>

<div id="outline-container-org529b0f4" class="outline-2">
<h2 id="org529b0f4"><span class="section-number-2">6</span> Scores Button</h2>
<div class="outline-text-2" id="text-6">
<p>
Scores displays current scores for all chapters in the current book.  It shows the average moves-to-tries ratio (scaled to be between 0 and 100) for each chapter for all-time, in the last 30 days, and in the last 7 days.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: @pawnzac</p>
<p class="date">Created: 2021-11-29 Mon 01:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
